{
  "basics": {
    "name": "Keith Cirkel",
    "label": "OSS & Web Standards Developer",
    "picture": "https://en.gravatar.com/userimage/17873740/9a796426f218d84db4a24905c3e5161b.jpeg?size=400",
    "email": "work@keithcirkel.co.uk",
    "summary": "OSS Contributor for projects including Sass, Chai & Babel. Contributor to JavaScript and HTML specifications. Proven track record of delivering solutions.",
    "location": {
      "city": "London",
      "countryCode": "GB"
    },
    "profiles": [
      {
        "network": "Website",
        "username": "https://keithcirkel.co.uk",
        "url": "https://keithcirkel.co.uk"
      },
      {
        "network": "GitHub",
        "username": "keithamus",
        "url": "https://github.com/keithamus"
      }
    ]
  },
  "work": [
    {
      "company": "GitHub",
      "position": "Senior Application Engineer",
      "website": "https://github.com",
      "startDate": "2017-06-06",
      "summary": "Working on platform systems teams delivering GitHub.com's JavaScript & UI components, to over 100,000 customers. Built industry leading components in GitHub's Primer design system - a modern, clean and accessible UI design system."
    },
    {
      "company": "Keith Cirkel LTD",
      "position": "Owner",
      "startDate": "2011-03-01",
      "endDate": "2017-06-02",
      "summary": "Consultancy company leading teams to success. Clients include Max Factor, Financial Times, The Economist, Kingfisher PLC, PhotoBox, BSkyB, British Gas (Centrica), EA, LexisNexis (Eslevier). Delivered solutions for clients following Agile principles, with strong TDD. Technologies included Node.JS, React, Chai, Redis, Varnish."
    },
    {
      "company": "Xcite Digital",
      "position": "Head of Creative",
      "website": "http://www.xcitedigital.com/",
      "startDate": "2010-04-01",
      "endDate": "2011-03-01",
      "summary": "Lead Frontend Developer, turned Head of Creative, working with many key clients.\n\nDeveloped and maintained large income client projects developed in Symfony 1.4, utilising jQuery for all frontend interactivity. Involved in key technical decisions, liaising with clients and suppliers and organising and managing other team members.\n\nManaged a series of virtual dedicated Linux servers, running Cherokee web server with MySQL and PHP.\n\nIntroduced Git to the team with no existing version control."
    },
    {
      "company": "BrightHue",
      "position": "Owner",
      "startDate": "2007-08-01",
      "endDate": "2010-04-01",
      "summary": "Digital Agency developing & designing sites & solutions for clients using PHP, MySQL, Javascript & jQuery.\n\nManaged and maintained virtual dedicated servers running a LAMP stack."
    },
    {
      "position": "Freelancer",
      "startDate": "2003-01-01",
      "endDate": "2007-01-01",
      "summary": "Worked with small clients developing and maintaining websites utilising technologies such as PHP, MySQL, Javascript & MooFX."
    }
  ],
  "publications": [
    {
      "name": "JavaScript Recipes - A Problem Solution Approach",
      "publisher": "Apress",
      "releaseDate": "2016-12-22",
      "website": "https://www.apress.com/us/book/9781430261063",
      "summary": "This comprehensive book is your go-to reference for tackling common and advanced JavaScript tasks. JavaScript is the world’s most popular client-side scripting language and is gaining popularity on the server. Using a problem-solution approach, this book takes you from language basics like built-in objects and flow control all the way to advanced optimization techniques, frameworks and Node.js. Quickly discover solutions to common problems, best practices you can follow, and everything JavaScript has to offer."
    }
  ],
  "volunteer": [
    {
      "organization": "CodeClub",
      "position": "Teacher",
      "website": "https://codeclub.org.uk/",
      "startDate": "2013-01-01",
      "summary": "Mentoring 9-11 year old pupils on how to program, using the Scratch programming environment."
    }
  ]
}
